Repository: KDE/plasma-disks
Catalog: po/*/kcm_disks.po
Languages: eo

# @label
source: Prefail attributes <= threshold.
eo: Antaŭmalsukcesaj atributoj <= sojlo.

# @label
source: SMART status check returned 'DISK OK' but we found that some (usage or prefail) attributes have been <= threshold at some time in the past.
eo: SMART statuskontrolo resendis 'DISKOKON' sed ni trovis ke kelkaj (uzado aŭ antaŭmalsukcesa) atributoj estis <= sojlo iam en la pasinteco.

# @label
source: The device error log contains records of errors.
eo: La erarprotokolo de aparato enhavas registrojn de eraroj.

# @label
source: The device self-test log contains records of errors. [ATA only] Failed self-tests outdated by a newer successful extended self-test are ignored.
eo: La aparato memtesta protokolo enhavas registrojn de eraroj. [ATA nur] Malsukcesaj memtestoj malmodernaj de pli nova sukcesa plilongigita memtesto estas ignorataj.

# @action/button action button to start partition manager
source: Open Partition Manager
eo: Malfermi Dispartigan Mastrumilon

# @action/button action button to start backup program
source: Perform Backup
eo: Fari Sekurkopion

# @info/status
source: Unable to obtain data. KDED is not running.
eo: Ne eblas akiri datumojn. KDED ne funkcias.

# @info/status
source: No S.M.A.R.T. devices found.
eo: Ne S.M.A.R.T. aparatoj trovitaj.

# @info
source: The SMART system of this device is reporting problems. This may be a sign of imminent device failure or data reliability being compromised. Back up your data and replace this drive as soon as possible to avoid losing any data.
eo: La SMART-sistemo de ĉi tiu aparato raportas problemojn. Ĉi tio povas esti signo de baldaŭa fiasko de la aparato aŭ endanĝerigita fidindeco de datumoj. Rezervu viajn datumojn kaj anstataŭigu ĉi tiun diskon kiel eble plej baldaŭ por eviti perdi ajnajn datumojn.

# @info %1 is a bunch of <li> with the strings from instabilities.cpp
source: <p>The SMART firmware is not reporting a failure, but there are early signs of malfunction. This might not point at imminent device failure but requires longer term analysis. Back up your data and contact the manufacturer of this disk, or replace it preemptively just to be safe.</p><ul>%1</ul>
eo: <p>La SMART-firmvaro ne raportas fiaskon, sed estas fruaj signoj de misfunkcio. Ĉi tio eble ne montras baldaŭan fiaskon de aparato sed postulas pli longdaŭran analizon. Sekurkopiu viajn datumojn kaj kontaktu la fabrikiston de ĉi tiu disko, aŭ anstataŭigu ĝin antaŭvide nur por esti sekura.</p><ul>%1</ul>

# @info
source: This device appears to be working as expected.
eo: Ĉi tiu aparato ŝajnas funkcii kiel atendite.

# @action/button action button to monitor a device for smart failure
source: Monitor
eo: Monitoro

# @action/button action button to ignore smart failures for a device
source: Ignore
eo: Ignori

# @action/button show detailed smart report
source: Show Details
eo: Montri Detalojn

source: Read SMART report for storage device %1
eo: Legi SMART-raporton por konserveja aparato %1

# @title notification
source: Storage Device Problems
eo: Problemoj pri konserveja aparato

source: The storage device <emphasis>%1</emphasis> (<filename>%2</filename>) is likely to fail soon!
eo: La konserva aparato <emphasis>%1</emphasis> (<filename>%2</filename>) verŝajne malsukcesos baldaŭ!

source: The storage device <emphasis>%1</emphasis> (<filename>%2</filename>) is showing indications of instability.
eo: La konserva aparato <emphasis>%1</emphasis> (<filename>%2</filename>) montras indikojn pri malstabileco.

# @action:button notification action to manage device problems
source: Manage
eo: Administri
